Repository: Abdelhamidzain/in_my_egys
Catalog: apps/flutter_app/lib/l10n/app_*.arb
Languages: ar

# appName
source: In My Eyes
ar: في عيوني

# disclaimer
source: This app is for reminders and tracking only and does not provide medical advice. Always follow your clinician's instructions.
ar: هذا التطبيق للتذكير والمتابعة فقط ولا يقدم نصائح طبية. اتبع تعليمات طبيبك دائمًا.

source: Welcome
ar: مرحباً بك

# welcomeSubtitle
source: Medication companion for families
ar: تطبيق في عيوني للعائلة

source: Log In
ar: تسجيل الدخول

source: Sign Up
ar: إنشاء حساب

source: Log Out
ar: تسجيل الخروج

source: Forgot Password?
ar: نسيت كلمة المرور؟

source: Reset Password
ar: إعادة تعيين كلمة المرور

source: Confirm Email
ar: تأكيد البريد الإلكتروني

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Confirm Password
ar: تأكيد كلمة المرور

# phone
source: Phone Number
ar: رقم الجوال

source: Name
ar: الاسم

# emailRequired
source: Email is required
ar: البريد الإلكتروني مطلوب

# emailInvalid
source: Invalid email address
ar: البريد الإلكتروني غير صحيح

# passwordRequired
source: Password is required
ar: كلمة المرور مطلوبة

# passwordTooShort
source: Password is too short (minimum 8 characters)
ar: كلمة المرور قصيرة جداً (8 أحرف على الأقل)

source: Passwords do not match
ar: كلمات المرور غير متطابقة

# nameRequired
source: Name is required
ar: الاسم مطلوب

source: Today
ar: اليوم

source: Medications
ar: الأدوية

source: Log
ar: السجل

source: Settings
ar: الإعدادات

source: Notifications
ar: الإشعارات

source: Next Dose
ar: الجرعة القادمة

# dueAt
source: Due at {time}
ar: موعدها الساعة {time}

# dueIn
source: In {duration}
ar: بعد {duration}

source: Overdue
ar: متأخر

source: Taken
ar: تم تناولها

source: Snooze
ar: تأجيل

source: Skip
ar: تخطي

source: Snooze Options
ar: خيارات التأجيل

# snoozeMinutes
source: {minutes} minutes
ar: {minutes} دقائق

source: Skip Reason
ar: سبب التخطي

# skipReasonForgot
source: Forgot
ar: نسيت

# skipReasonNotAvailable
source: Not available
ar: الدواء غير متوفر

# skipReasonTravel
source: Traveling
ar: في سفر

# skipReasonOther
source: Other
ar: سبب آخر

# todaySchedule
source: Today's Schedule
ar: جدول اليوم

# noMedicationsToday
source: No medications scheduled for today
ar: لا توجد أدوية مجدولة لليوم

source: All doses completed!
ar: تم تناول جميع الجرعات!

source: Profiles
ar: الملفات الشخصية

source: Add Profile
ar: إضافة ملف

source: Edit Profile
ar: تعديل الملف

source: Delete Profile
ar: حذف الملف

source: Switch Profile
ar: تغيير الملف

source: Profile Name
ar: اسم الملف

source: Relationship
ar: صلة القرابة

# relationshipSelf
source: Self
ar: أنا

# relationshipMother
source: Mother
ar: أمي

# relationshipFather
source: Father
ar: أبي

# relationshipSpouse
source: Spouse
ar: زوجي/زوجتي

# relationshipChild
source: Child
ar: ابني/ابنتي

# relationshipGrandparent
source: Grandparent
ar: جدي/جدتي

# relationshipOther
source: Other
ar: آخر

# profileTypeSelf
source: My Profile
ar: ملفي الشخصي

# profileTypeManaged
source: Managed Profile
ar: ملف أديره

# profileTypeLinked
source: Linked Profile
ar: ملف مرتبط

source: Senior Mode
ar: وضع كبار السن

# seniorModeDescription
source: Larger buttons and simpler interface
ar: أزرار أكبر وواجهة أبسط

source: High Contrast
ar: تباين عالي

source: Add Medication
ar: إضافة دواء

source: Edit Medication
ar: تعديل الدواء

source: Medication Name
ar: اسم الدواء

source: Instructions
ar: التعليمات

# instructionsHint
source: e.g., Take one tablet after meals
ar: مثال: قرص واحد بعد الأكل

source: Medication Photos
ar: صور الدواء

source: Pill Photo
ar: صورة الحبة

source: Box Photo
ar: صورة العلبة

source: Add Photo
ar: إضافة صورة

source: Take Photo
ar: التقاط صورة

source: Choose from Gallery
ar: اختيار من المعرض

source: Visual Tags
ar: علامات مميزة

# visualTagWhite
source: White
ar: أبيض

# visualTagPink
source: Pink
ar: وردي

# visualTagBlue
source: Blue
ar: أزرق

# visualTagYellow
source: Yellow
ar: أصفر

# visualTagGreen
source: Green
ar: أخضر

# visualTagRound
source: Round
ar: دائري

# visualTagOval
source: Oval
ar: بيضاوي

# visualTagCapsule
source: Capsule
ar: كبسولة

# visualTagSmall
source: Small
ar: صغير

# visualTagLarge
source: Large
ar: كبير

source: Schedule
ar: الجدول

source: Schedule Type
ar: نوع الجدول

# dailyFixedTimes
source: Daily at fixed times
ar: يومياً في أوقات محددة

# daysOfWeek
source: Specific days of the week
ar: أيام محددة من الأسبوع

# everyXHours
source: Every few hours
ar: كل عدة ساعات

source: Select Times
ar: اختر الأوقات

source: Add Time
ar: إضافة وقت

source: Select Days
ar: اختر الأيام

# everyHours
source: Every {hours} hours
ar: كل {hours} ساعات

source: Pre-alert
ar: تنبيه مسبق

# preAlertMinutes
source: {minutes} minutes before
ar: قبل {minutes} دقيقة

source: Start Date
ar: تاريخ البداية

source: End Date
ar: تاريخ النهاية

source: Ongoing
ar: مستمر

source: Medication Status
ar: حالة الدواء

# statusActive
source: Active
ar: نشط

# statusPaused
source: Paused
ar: متوقف

# statusArchived
source: Archived
ar: مؤرشف

source: Caregiver
ar: مقدم الرعاية

source: Caregivers
ar: مقدمو الرعاية

source: Add Caregiver
ar: إضافة مقدم رعاية

source: Invite Caregiver
ar: دعوة مقدم رعاية

source: Caregiver Permissions
ar: صلاحيات مقدم الرعاية

# canAddEditMeds
source: Can add and edit medications
ar: يمكنه إضافة وتعديل الأدوية

# canViewLog
source: Can view adherence log
ar: يمكنه عرض سجل الالتزام

# notifyIfNoConfirmation
source: Notify me if dose not confirmed
ar: إشعاري عند عدم تأكيد الجرعة

source: Pairing Invite
ar: دعوة ربط

source: Pair Code
ar: رمز الربط

source: Enter Pair Code
ar: أدخل رمز الربط

source: Send via WhatsApp
ar: إرسال عبر واتساب

# inviteExpires
source: Invite expires in {hours} hours
ar: تنتهي الدعوة خلال {hours} ساعة

source: Invite accepted!
ar: تم قبول الدعوة!

source: Consent
ar: الموافقة

# consentTitle
source: Caregiver Permissions
ar: صلاحيات مقدم الرعاية

# consentDescription
source: Choose the permissions you want to grant to your caregiver
ar: اختر الصلاحيات التي تريد منحها لمقدم الرعاية

source: Accept and Continue
ar: موافقة ومتابعة

source: Doctor Visit Mode
ar: وضع زيارة الطبيب

source: Share with Doctor
ar: مشاركة مع الطبيب

# generateQR
source: Generate QR Code
ar: إنشاء رمز QR

source: Share Scope
ar: نطاق المشاركة

# scopeMedsOnly
source: Medications only
ar: الأدوية فقط

# scopeMedsAndLog
source: Medications and adherence log
ar: الأدوية وسجل الالتزام

source: Expiry Time
ar: مدة الصلاحية

# minutes
source: {count} minutes
ar: {count} دقيقة

source: Share Active
ar: المشاركة نشطة

source: Share Expired
ar: انتهت المشاركة

source: Revoke Share
ar: إلغاء المشاركة

source: Export PDF
ar: تصدير PDF

source: Adherence
ar: الالتزام

source: Adherence Rate
ar: نسبة الالتزام

source: Adherence Summary
ar: ملخص الالتزام

source: Last 7 days
ar: آخر 7 أيام

source: Last 30 days
ar: آخر 30 يوم

# dosesConfirmed
source: Doses taken
ar: جرعات تم تناولها

source: Doses skipped
ar: جرعات تم تخطيها

source: Doses missed
ar: جرعات فائتة

source: Subscription
ar: الاشتراك

source: Free Plan
ar: الخطة المجانية

source: Pro Plan
ar: الخطة المميزة

source: Current Plan
ar: خطتك الحالية

source: Upgrade to Pro
ar: ترقية للمميزة

# freePlanFeatures
source: Up to 2 profiles 3 medications per profile Reminders and adherence log Weekly summary view
ar: حتى ملفين 3 أدوية لكل ملف تذكيرات وسجل الالتزام عرض ملخص أسبوعي

# proPlanFeatures
source: Unlimited profiles Unlimited medications Caregiver notifications QR sharing with doctors PDF export Advanced summaries
ar: ملفات غير محدودة أدوية غير محدودة إشعارات لمقدمي الرعاية مشاركة QR مع الطبيب تصدير PDF ملخصات متقدمة

source: Limit Reached
ar: وصلت للحد الأقصى

# profileLimitReached
source: You've reached the maximum profiles on the free plan
ar: وصلت للحد الأقصى من الملفات في الخطة المجانية

# medicationLimitReached
source: You've reached the maximum medications on the free plan
ar: وصلت للحد الأقصى من الأدوية في الخطة المجانية

# upgradeToAdd
source: Upgrade to add more
ar: قم بالترقية لإضافة المزيد

source: PIN
ar: رمز PIN

source: Set PIN
ar: تعيين رمز PIN

source: Enter PIN
ar: أدخل رمز PIN

source: Confirm PIN
ar: تأكيد رمز PIN

source: Change PIN
ar: تغيير رمز PIN

# pinRequired
source: PIN required to access
ar: رمز PIN مطلوب للدخول

source: Wrong PIN
ar: رمز PIN غير صحيح

# biometricAuth
source: Biometric Authentication
ar: المصادقة البيومترية

# useBiometric
source: Use Fingerprint / Face ID
ar: استخدام البصمة / Face ID

source: Language
ar: اللغة

source: Timezone
ar: المنطقة الزمنية

# timezoneHome
source: Home Timezone
ar: المنطقة الزمنية الأساسية

# timezoneCurrent
source: Current Timezone
ar: المنطقة الزمنية الحالية

source: About
ar: عن التطبيق

source: Privacy Policy
ar: سياسة الخصوصية

source: Terms of Service
ar: شروط الاستخدام

source: Contact Support
ar: تواصل معنا

source: Version
ar: الإصدار

source: Save
ar: حفظ

source: Cancel
ar: إلغاء

source: Delete
ar: حذف

source: Edit
ar: تعديل

source: Done
ar: تم

source: Next
ar: التالي

source: Back
ar: رجوع

source: Confirm
ar: تأكيد

source: Close
ar: إغلاق

source: Retry
ar: إعادة المحاولة

source: Loading...
ar: جاري التحميل...

source: Saving...
ar: جاري الحفظ...

source: Error
ar: خطأ

source: Success
ar: تم بنجاح

source: Offline
ar: غير متصل

# offlineBanner
source: You're offline. Changes will sync when connected.
ar: أنت غير متصل. التغييرات ستُحفظ عند الاتصال.

source: Syncing...
ar: جاري المزامنة...

source: Sync complete
ar: تمت المزامنة

# deleteConfirmTitle
source: Confirm Delete
ar: تأكيد الحذف

# deleteProfileConfirm
source: Are you sure you want to delete this profile? All medications and records will be deleted.
ar: هل أنت متأكد من حذف هذا الملف؟ سيتم حذف جميع الأدوية والسجلات المرتبطة به.

# deleteMedicationConfirm
source: Are you sure you want to delete this medication?
ar: هل أنت متأكد من حذف هذا الدواء؟

source: No notifications
ar: لا توجد إشعارات

source: Mark as read
ar: تحديد كمقروء

source: Mark all as read
ar: تحديد الكل كمقروء

source: Admin Dashboard
ar: لوحة التحكم

# adminUsers
source: Users
ar: المستخدمون

# adminProfiles
source: Profiles
ar: الملفات

# adminMedications
source: Medications
ar: الأدوية

# adminExports
source: Exports
ar: التصدير

# adminAnalytics
source: Analytics
ar: الإحصائيات

# adminAudit
source: Audit Log
ar: سجل العمليات

source: Search users...
ar: بحث عن مستخدم...

source: Search profiles...
ar: بحث عن ملف...

source: User Details
ar: تفاصيل المستخدم

source: Ban User
ar: حظر المستخدم

source: Unban User
ar: إلغاء حظر المستخدم

source: Export CSV
ar: تصدير CSV

source: Total Users
ar: إجمالي المستخدمين

source: Active Users
ar: مستخدمون نشطون

# dosesToday
source: Today's Doses
ar: جرعات اليوم

source: Caregiver Links
ar: روابط مقدمي الرعاية

source: Sunday
ar: الأحد

source: Monday
ar: الاثنين

source: Tuesday
ar: الثلاثاء

source: Wednesday
ar: الأربعاء

source: Thursday
ar: الخميس

source: Friday
ar: الجمعة

source: Saturday
ar: السبت

# analyticsOverview
source: Overview
ar: نظرة عامة

# analyticsUserStats
source: User Statistics
ar: إحصائيات المستخدمين

# analyticsAdherenceStats
source: Adherence Metrics
ar: إحصائيات الالتزام

# analyticsFeatureUsage
source: Feature Usage
ar: استخدام الميزات

# analyticsTrends
source: Trends
ar: الاتجاهات

source: Pro Users
ar: مستخدمو Pro

source: Free Users
ar: مستخدمو المجاني

# activeUsersLast7Days
source: Active (7d)
ar: نشطون (7 أيام)

# activeUsersLast30Days
source: Active (30d)
ar: نشطون (30 يوم)

source: Linked Profiles
ar: ملفات مرتبطة

source: Managed Profiles
ar: ملفات مُدارة

source: Active Medications
ar: أدوية نشطة

source: Taken Today
ar: تم تناولها اليوم

source: Missed Today
ar: فائتة اليوم

source: Taken This Week
ar: تم تناولها هذا الأسبوع

source: Missed This Week
ar: فائتة هذا الأسبوع

source: Taken This Month
ar: تم تناولها هذا الشهر

source: Missed This Month
ar: فائتة هذا الشهر

source: QR Share Sessions
ar: جلسات مشاركة QR

source: PDF Exports
ar: تصديرات PDF

source: Caregiver Link Rate
ar: نسبة ربط مقدمي الرعاية

source: Signup Trend
ar: اتجاه التسجيل

source: Adherence Trend
ar: اتجاه الالتزام

# last7DaysChart
source: Last 7 Days
ar: آخر 7 أيام

# last30DaysChart
source: Last 30 Days
ar: آخر 30 يوم

# last90DaysChart
source: Last 90 Days
ar: آخر 90 يوم

# timeRange7d
source: 7 days
ar: 7 أيام

# timeRange30d
source: 30 days
ar: 30 يوم

# timeRange90d
source: 90 days
ar: 90 يوم

source: Refresh
ar: تحديث

source: Refreshing...
ar: جاري التحديث...

# lastUpdated
source: Last updated: {time}
ar: آخر تحديث: {time}

source: Audit Logs
ar: سجل العمليات

# filterByActor
source: Filter by actor email
ar: تصفية حسب البريد الإلكتروني

source: Filter by action
ar: تصفية حسب الإجراء

source: Filter by date
ar: تصفية حسب التاريخ

source: All actions
ar: جميع الإجراءات

source: Clear filters
ar: مسح الفلاتر

source: Active filters
ar: فلاتر نشطة

# actionPairInviteCreated
source: Pair Invite Created
ar: إنشاء دعوة ربط

# actionPairInviteAccepted
source: Pair Invite Accepted
ar: قبول دعوة ربط

# actionShareSessionCreated
source: Share Session Created
ar: إنشاء جلسة مشاركة

# actionShareSessionRevoked
source: Share Session Revoked
ar: إلغاء جلسة مشاركة

# actionShareSessionViewed
source: Share Session Viewed
ar: عرض جلسة مشاركة

# actionPdfGenerated
source: PDF Generated
ar: إنشاء PDF

# actionEscalationSent
source: Escalation Sent
ar: إرسال تصعيد

# actionAdminExport
source: Admin Export
ar: تصدير إداري

# actionAdminBanUser
source: User Banned
ar: حظر مستخدم

# actionAdminUnbanUser
source: User Unbanned
ar: إلغاء حظر مستخدم

# actionProfileCreated
source: Profile Created
ar: إنشاء ملف

# actionProfileUpdated
source: Profile Updated
ar: تعديل ملف

# actionProfileDeleted
source: Profile Deleted
ar: حذف ملف

# actionMedicationCreated
source: Medication Created
ar: إضافة دواء

# actionMedicationUpdated
source: Medication Updated
ar: تعديل دواء

# actionMedicationDeleted
source: Medication Deleted
ar: حذف دواء

# actionCaregiverAdded
source: Caregiver Added
ar: إضافة مقدم رعاية

# actionCaregiverRemoved
source: Caregiver Removed
ar: إزالة مقدم رعاية

# actionViewAnalytics
source: View Analytics
ar: عرض الإحصائيات

# auditLogDetails
source: Log Details
ar: تفاصيل السجل

source: Actor
ar: المنفذ

source: Target Profile
ar: الملف المستهدف

source: Timestamp
ar: الوقت

source: Metadata
ar: البيانات التفصيلية

# noLogsFound
source: No audit logs found
ar: لم يتم العثور على سجلات

# pageOf
source: Page {current} of {total}
ar: صفحة {current} من {total}

# previousPage
source: Previous
ar: السابق

# nextPage
source: Next
ar: التالي

# perPage
source: {count} per page
ar: {count} لكل صفحة

# clearPhoto
source: Clear
ar: مسح

# replacePhoto
source: Replace
ar: استبدال

# confirmDeleteMedication
source: Delete Medication
ar: حذف الدواء

# deleteWarning
source: This action cannot be undone.
ar: لا يمكن التراجع عن هذا الإجراء.

# dateFrom
source: From
ar: من

# dateTo
source: To
ar: إلى

source: Select date range
ar: اختر نطاق التاريخ

# applyFilter
source: Apply
ar: تطبيق

source: No pre-alert
ar: بدون تنبيه مسبق

source: Remove time
ar: إزالة الوقت

source: Search medications...
ar: بحث عن دواء...

source: Filter by profile
ar: تصفية حسب الملف

source: Filter by status
ar: تصفية حسب الحالة

source: All profiles
ar: جميع الملفات

source: All statuses
ar: جميع الحالات

# userCreatedAt
source: Account created
ar: تاريخ إنشاء الحساب

source: Profiles owned
ar: الملفات المملوكة

source: Banned
ar: محظور

source: Active
ar: نشط

# errorEmailRequired
source: Email is required
ar: البريد الإلكتروني مطلوب

# errorEmailInvalid
source: Invalid email address
ar: البريد الإلكتروني غير صالح

# errorPasswordRequired
source: Password is required
ar: كلمة المرور مطلوبة

# errorPasswordTooShort
source: Password is too short
ar: كلمة المرور قصيرة جداً

# errorConfirmPasswordRequired
source: Please confirm password
ar: تأكيد كلمة المرور مطلوب

# errorPasswordsDoNotMatch
source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# errorPinRequired
source: PIN is required
ar: الرمز السري مطلوب

# errorPinInvalidLength
source: PIN must be 4 digits
ar: الرمز السري يجب أن يكون 4 أرقام

# errorPinDigitsOnly
source: PIN must contain only digits
ar: الرمز السري يجب أن يحتوي على أرقام فقط

# errorPhoneRequired
source: Phone number is required
ar: رقم الهاتف مطلوب

# errorPhoneInvalid
source: Invalid phone number
ar: رقم الهاتف غير صالح

# errorRequired
source: This field is required
ar: هذا الحقل مطلوب

# errorFieldRequired
source: {field} is required
ar: {field} مطلوب

# errorMedNameRequired
source: Medication name is required
ar: اسم الدواء مطلوب

# errorMedNameTooShort
source: Medication name is too short
ar: اسم الدواء قصير جداً

# errorMedNameTooLong
source: Medication name is too long
ar: اسم الدواء طويل جداً

# errorPairCodeRequired
source: Pair code is required
ar: رمز الاقتران مطلوب

# errorPairCodeInvalid
source: Invalid pair code
ar: رمز الاقتران غير صالح

# errorEveryXHoursRequired
source: Hours interval is required
ar: عدد الساعات مطلوب

# errorEveryXHoursInvalid
source: Invalid hours interval
ar: عدد الساعات غير صالح

# errorProfileNameRequired
source: Profile name is required
ar: اسم الملف مطلوب

# errorProfileNameTooShort
source: Profile name is too short
ar: اسم الملف قصير جداً

# errorProfileNameTooLong
source: Profile name is too long
ar: اسم الملف طويل جداً

# errorScheduleTimesRequired
source: Schedule times are required
ar: أوقات الجدول مطلوبة

# errorScheduleTimesDuplicate
source: Duplicate times found
ar: توجد أوقات مكررة

# errorScheduleTimesTooMany
source: Too many schedule times
ar: عدد الأوقات كبير جداً

# errorShareExpiryRequired
source: Expiry date is required
ar: تاريخ الانتهاء مطلوب

# errorShareExpiryInvalid
source: Invalid expiry date
ar: تاريخ الانتهاء غير صالح

# errorTimeRequired
source: Time is required
ar: الوقت مطلوب

# errorTimeInvalid
source: Invalid time
ar: الوقت غير صالح

# errorTimezoneRequired
source: Timezone is required
ar: المنطقة الزمنية مطلوبة

# errorTimezoneInvalid
source: Invalid timezone
ar: المنطقة الزمنية غير صالحة

source: Today's Schedule
ar: جدول اليوم

source: No medications yet
ar: لا توجد أدوية بعد

# addFirstMedication
source: Add your first medication
ar: أضف أول دواء

source: Pending sync
ar: في انتظار المزامنة

# pleaseSelectProfile
source: Please select a profile
ar: الرجاء اختيار ملف شخصي

source: Upgrade
ar: ترقية

source: Medication added
ar: تمت إضافة الدواء

source: Error adding medication
ar: خطأ في إضافة الدواء

source: Basic Info
ar: المعلومات الأساسية

source: Photos
ar: الصور

source: Medication Details
ar: تفاصيل الدواء

# medicationNameHint
source: Enter medication name
ar: أدخل اسم الدواء

# medicationNameRequired
source: Medication name is required
ar: اسم الدواء مطلوب

# medicationNameTooShort
source: Medication name is too short
ar: اسم الدواء قصير جداً

# medicationNameTooLong
source: Medication name is too long
ar: اسم الدواء طويل جداً

source: Add Photos
ar: إضافة صور

# photosHelp
source: Add photos to identify your medication
ar: أضف صور للدواء للتعرف عليه بسهولة

# visualTagsHelp
source: Add visual tags for your medication
ar: أضف علامات مرئية للدواء

source: No profile selected
ar: لم يتم اختيار ملف

source: No profiles
ar: لا توجد ملفات

# noProfilesDescription
source: Create a profile to get started
ar: أنشئ ملفاً شخصياً للبدء

source: Create Profile
ar: إنشاء ملف

source: Profile created
ar: تم إنشاء الملف

# profileNameHint
source: Enter profile name
ar: أدخل اسم الملف

source: Profile Type
ar: نوع الملف

source: Profile Settings
ar: إعدادات الملف

source: Managed Profile
ar: ملف مُدار

# managedProfileDescription
source: A profile for someone you care for
ar: ملف شخص تعتني به

source: Linked Profile
ar: ملف مرتبط

# linkedProfileDescription
source: A profile for someone caring for you
ar: ملف شخص يعتني بك

# linkedProfileDisclaimer
source: This person will be able to see your medications
ar: سيتمكن هذا الشخص من رؤية أدويتك

source: Link with Caregiver
ar: ربط مع مقدم رعاية

# linkingWithCaregiver
source: Linking...
ar: جاري الربط...

source: Linked successfully
ar: تم الربط بنجاح

# linkedSuccessfullyDescription
source: Profile linked successfully
ar: تم ربط الملف بنجاح

source: Accept and Link
ar: قبول وربط

source: Permissions
ar: الصلاحيات

source: Choose Permissions
ar: اختر الصلاحيات

# canChangePermissionsLater
source: You can change permissions later
ar: يمكنك تغيير الصلاحيات لاحقاً

source: Medications Only
ar: الأدوية فقط

# medicationsOnlyDescription
source: View medications only
ar: عرض الأدوية فقط

source: Medications and Log
ar: الأدوية والسجل

# medicationsAndLogDescription
source: View medications and adherence log
ar: عرض الأدوية وسجل الالتزام

# manageMediactions
source: Manage Medications
ar: إدارة الأدوية

# manageMedicationsDescription
source: Add and edit medications
ar: إضافة وتعديل الأدوية

source: Receive Alerts
ar: استلام التنبيهات

# receiveAlertsDescription
source: Receive alerts when doses are missed
ar: استلام تنبيهات عند تفويت جرعة

source: View Adherence Log
ar: عرض سجل الالتزام

# viewAdherenceLogDescription
source: View medication history
ar: عرض تاريخ تناول الأدوية

source: Share QR
ar: مشاركة QR

# shareQrDescription
source: Share QR code for linking
ar: مشاركة رمز QR للربط

source: Generate QR Code
ar: إنشاء رمز QR

# qrShareDisclaimer
source: Share this code with your caregiver
ar: شارك هذا الرمز مع مقدم الرعاية

# qrStep1
source: Open the app on caregiver device
ar: افتح التطبيق على جهاز مقدم الرعاية

# qrStep2
source: Tap Add Linked Profile
ar: اضغط على إضافة ملف مرتبط

# qrStep3
source: Scan the QR code
ar: امسح رمز QR

# qrStep4
source: Accept the link request
ar: اقبل طلب الربط

source: How it works
ar: كيف يعمل

source: Copy Link
ar: نسخ الرابط

source: Link copied
ar: تم نسخ الرابط

source: Share Options
ar: خيارات المشاركة

source: Expires in
ar: ينتهي في

source: Invite created
ar: تم إنشاء الدعوة

source: Invite expires in 72 hours
ar: تنتهي الدعوة خلال 72 ساعة

# inviteInstructions
source: Send this link to your caregiver
ar: أرسل هذا الرابط لمقدم الرعاية

source: Send Invite
ar: إرسال دعوة

source: Revoke
ar: إلغاء

source: Share session revoked
ar: تم إلغاء جلسة المشاركة

source: Sharing
ar: المشاركة

source: What to share
ar: ماذا تريد مشاركته

# shareWithDoctorDescription
source: Share your info with your doctor
ar: شارك معلوماتك مع طبيبك

# doctorVisitDescription
source: Information for doctor visit
ar: معلومات لزيارة الطبيب

source: Export PDF
ar: تصدير PDF

source: Generating PDF...
ar: جاري إنشاء PDF...

source: PDF generated
ar: تم إنشاء PDF

source: Download
ar: تحميل

# enterPairCodeDescription
source: Enter the pair code
ar: أدخل رمز الاقتران

# whereToFindCode
source: Where to find the code?
ar: أين أجد الرمز؟

# whereToFindCodeDescription
source: Ask the person you want to link with
ar: اطلب الرمز من الشخص الذي تريد الربط معه

# caregiverConsentDisclaimer
source: By accepting, you will be able to see this person's medications
ar: بالموافقة، ستتمكن من رؤية أدوية هذا الشخص

source: Verify
ar: تحقق

source: Processing...
ar: جاري المعالجة...

source: All
ar: الكل

source: Daily
ar: يومي

source: Specific Days
ar: أيام محددة

source: Interval
ar: فترة زمنية

source: Repeat every
ar: تكرار كل

source: hour
ar: ساعة

source: hours
ar: ساعات

source: times
ar: مرات

source: At least one time
ar: وقت واحد على الأقل

source: Before
ar: قبل

source: Date Range
ar: نطاق التاريخ

source: Filters
ar: الفلاتر

source: Apply Filters
ar: تطبيق الفلاتر

source: Filters applied
ar: تم تطبيق الفلاتر

source: Clear
ar: مسح

source: Clear All
ar: مسح الكل

source: Event Type
ar: نوع الحدث

source: Skipped
ar: تم تخطيه

source: Snoozed
ar: تم تأجيله

source: Snoozed for
ar: مؤجل لـ

source: Snooze for
ar: تأجيل لـ

source: Yesterday
ar: أمس

source: Other
ar: أخرى

source: No events found
ar: لا توجد أحداث

source: Adherence Log
ar: سجل الالتزام

source: Error loading data
ar: خطأ في تحميل البيانات

source: Error loading medications
ar: خطأ في تحميل الأدوية
