Repository: Abdelhamidzain/in_my_egys
Catalog: apps/flutter_app/lib/l10n/app_*.arb
Languages: ar

source: Error loading profiles
ar: خطأ في تحميل الملفات

source: No active medications
ar: لا توجد أدوية نشطة

source: No archived medications
ar: لا توجد أدوية مؤرشفة

source: No paused medications
ar: لا توجد أدوية موقوفة

source: No doses scheduled
ar: لا توجد جرعات مجدولة

source: All done for today
ar: انتهيت من كل شيء اليوم

# doseTakenSuccess
source: Dose recorded
ar: تم تسجيل الجرعة

source: Dose skipped
ar: تم تخطي الجرعة

source: Pause
ar: إيقاف

source: Paused
ar: موقوف

source: Resume
ar: استئناف

source: Archived
ar: مؤرشف

source: Delete Medication
ar: حذف الدواء

source: Medication
ar: دواء

source: Traveling
ar: مسافر

source: Not available
ar: غير متوفر

source: Account
ar: الحساب

source: App Settings
ar: إعدادات التطبيق

source: PIN Security
ar: أمان الرمز السري

source: Set up PIN
ar: إعداد رمز سري

source: Create PIN
ar: إنشاء رمز سري

# createPinSubtitle
source: Create a 4-digit PIN
ar: أنشئ رمزاً سرياً من 4 أرقام

# confirmPinSubtitle
source: Re-enter your PIN
ar: أعد إدخال الرمز السري

# enterPinSubtitle
source: Enter your PIN
ar: أدخل الرمز السري

source: Remove PIN
ar: إزالة الرمز السري

source: PIN removed
ar: تم إزالة الرمز السري

source: PINs do not match
ar: الرمزان غير متطابقين

source: Incorrect PIN
ar: رمز سري غير صحيح

source: Error saving PIN
ar: خطأ في حفظ الرمز السري

source: Biometric Unlock
ar: فتح ببصمة الإصبع

source: Help & Support
ar: المساعدة والدعم

source: FAQ
ar: الأسئلة الشائعة

# faq1Question
source: How do I add a medication?
ar: كيف أضيف دواء؟

# faq1Answer
source: Tap the + button on the home screen
ar: اضغط على زر + في الشاشة الرئيسية

# faq2Question
source: How do I link with a caregiver?
ar: كيف أربط مع مقدم رعاية؟

# faq2Answer
source: Go to Profiles and select Share QR
ar: اذهب إلى الملفات واختر مشاركة QR

# faq3Question
source: How do I export a report?
ar: كيف أصدر تقريراً؟

# faq3Answer
source: Go to Doctor Visit and select Export PDF
ar: اذهب إلى زيارة الطبيب واختر تصدير PDF

# logoutConfirm
source: Do you want to log out?
ar: هل تريد تسجيل الخروج؟

source: Forgot?
ar: نسيت؟

source: Go to App
ar: الذهاب للتطبيق

source: Profile
ar: الملف

source: Feature
ar: ميزة

source: Free
ar: مجاني

source: Unlimited
ar: غير محدود

source: Recommended
ar: موصى به

# proPrice
source: $9.99/year
ar: ٩٩ ريال/سنة

# youAreOnFree
source: You are on the Free plan
ar: أنت على الخطة المجانية

# youAreOnPro
source: You are on the Pro plan
ar: أنت على خطة Pro

source: Upgrade Required
ar: الترقية مطلوبة

source: Upgrade to add more profiles
ar: قم بالترقية لإضافة المزيد من الملفات

# upgradeConfirmation
source: Do you want to upgrade?
ar: هل تريد الترقية؟

# upgradeSuccess
source: Upgrade successful
ar: تمت الترقية بنجاح

# paymentNote
source: Payment via app store
ar: سيتم الدفع عبر المتجر

# freeFeature1
source: 1 Profile
ar: ملف واحد

# freeFeature1Unlimited
source: Unlimited Profiles
ar: ملفات غير محدودة

# freeFeature2
source: 5 Medications
ar: 5 أدوية

# freeFeature2Unlimited
source: Unlimited Medications
ar: أدوية غير محدودة

# freeFeature3
source: Basic Reminders
ar: تذكيرات أساسية

# freeFeature4
source: 7-day Log
ar: سجل 7 أيام

# proFeature1
source: Unlimited Profiles
ar: ملفات غير محدودة

# proFeature2
source: Unlimited Medications
ar: أدوية غير محدودة

# proFeature3
source: PDF Export
ar: تصدير PDF

# proFeature4
source: Full Log
ar: سجل كامل

source: Feature Comparison
ar: مقارنة الميزات

# featureMedications
source: Medications
ar: الأدوية

# featureProfiles
source: Profiles
ar: الملفات

# featureReminders
source: Reminders
ar: التذكيرات

# featureAdherenceLog
source: Adherence Log
ar: سجل الالتزام

# featurePdfExport
source: PDF Export
ar: تصدير PDF

# featureQrShare
source: QR Share
ar: مشاركة QR

# featureAdvancedSummaries
source: Advanced Summaries
ar: ملخصات متقدمة

# featureCaregiverEscalation
source: Caregiver Escalation
ar: تصعيد لمقدم الرعاية

# noNotificationsDescription
source: No notifications
ar: لا توجد إشعارات

source: Mark all read
ar: تعليم الكل كمقروء

source: All notifications marked read
ar: تم تعليم كل الإشعارات كمقروءة

source: Patient Phone
ar: رقم هاتف المريض

# patientPhoneHelper
source: Enter phone number
ar: أدخل رقم الهاتف

# phoneRequired
source: Phone number is required
ar: رقم الهاتف مطلوب

source: Invalid phone format
ar: صيغة الهاتف غير صحيحة

# nameTooShort
source: Name is too short
ar: الاسم قصير جداً

source: Paste
ar: لصق
